// 2024

const [N, K] = require("fs")
  .readFileSync("example.txt")
  .toString()
  .trim()
  .split(" ")
  .map(Number);

let arr = Array.from({ length: K + 1 }, () => Array(N + 1).fill(0));
for (let i = 1; i <= K; i++) {
  arr[i][0] = 1; // 0을 만드는 방법은 1가지
}
// console.log(0, arr);

for (let j = 0; j <= N; j++) {
  arr[1][j] = 1; // 1개의 숫자로 j를 만드는 방법은 1가지
}
// console.log(1, arr);

for (let i = 2; i <= K; i++) {
  for (let j = 1; j <= N; j++) {
    arr[i][j] = (arr[i - 1][j] + arr[i][j - 1]) % 1000000000; // 1000000000으로 나눈
  }
}
// console.log("n", arr);
console.log(arr[K][N]);
/**
 * 0 -> 0
 * 1 -> 1
 *     => 1   {1:1}
 * 2 -> 1+1, 2
 *     => 2   {1:1, 2:1}
 * 3 -> 1+1+1, 2+1, 1+2, 3
 *     => 4   {1:1, 2:2, 3:1}
 * 4 -> 1+1+1+1, 2+1+1, 1+2+1, 3+1, 1+1+2, 2+2, 1+3, 4
 *     => 8   {1:1, 2:3, 3:3, 4:1}
 * 5 -> 1+1+1+1+1, 2+1+1+1, 1+2+1+1, 3+1+1, 1+1+2+1, 2+2+1, 1+3+1, 4+1,
 *     1+1+1+2, 2+1+2, 1+2+2, 3+2
 *     1+1+3, 2+3
 *     1+4
 *     5
 *     => 16  {1:1, 2:4, 3:6 , 4:4 ,5:1}
 */
